Table of Contents
 Enum TypeEdgePosition
Namespace
IdeaRS.OpenModel.Detail
Assembly
IdeaRS.OpenModel.dll
Type edge position
public enum TypeEdgePosition
Fields
PartEdge = 1
part of the edge, mereno od pocatku hrany nebo podle zadani v jinem properties
PartEdgeFromEnd = 4
on part of edge measured from end of the edge
PartEdgeToEndEdge = 2
parts of the edge to end edge - pouze na vybranem vlasniku - napriklad u linioveho zatizeni na hrane
PartEdgeToSegment = 3
parts on edge, protazene az k segmentu nebo k poslenimu pruseciku s vnejsim obrysem - napriklad u vyztuze
WholeLength = 0
whole length
Fields
 Name |  Description
 PartEdge = 1
part of the edge, mereno od pocatku hrany nebo podle zadani v jinem properties
 PartEdgeFromEnd = 4
on part of edge measured from end of the edge
 PartEdgeToEndEdge = 2
parts of the edge to end edge - pouze na vybranem vlasniku - napriklad u linioveho zatizeni na hrane
 PartEdgeToSegment = 3
parts on edge, protazene az k segmentu nebo k poslenimu pruseciku s vnejsim obrysem - napriklad u vyztuze
 WholeLength = 0
whole length
 Edit this page